In [1]:
import pandas as pd
import numpy as np

# 1. Data Frames

In [2]:
forum_users = {
    'User ID': [1,2,3,4,5],
    'Username': ['bogdan_s', 'jane_smith', 'alex123', 'bob56', 'mark_wilson'],
    'Age': [18,35,25,38,45],
    'Joined Date': ['2032-01-01', '2032-02-15','2032-04-25','2032-06-21','2032-09-15'],
    'Total Posts': [150,230,80,420,310],
    'Reputation': [500, 720,200,940,500]
}


df = pd.DataFrame(forum_users)
df

   User ID     Username  Age Joined Date  Total Posts  Reputation
0        1     bogdan_s   18  2032-01-01          150         500
1        2   jane_smith   35  2032-02-15          230         720
2        3      alex123   25  2032-04-25           80         200
3        4        bob56   38  2032-06-21          420         940
4        5  mark_wilson   45  2032-09-15          310         500

In [3]:
df.shape

(5, 6)

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
df.columns

Index(['User ID', 'Username', 'Age', 'Joined Date', 'Total Posts',
       'Reputation'],
      dtype='object')

In [6]:
type(df.columns)

pandas.core.indexes.base.Index

In [7]:
df.columns.tolist()

['User ID', 'Username', 'Age', 'Joined Date', 'Total Posts', 'Reputation']

In [8]:
df.index.tolist()

[0, 1, 2, 3, 4]

In [9]:
df.dtypes

User ID         int64
Username       object
Age             int64
Joined Date    object
Total Posts     int64
Reputation      int64
dtype: object

In [10]:
df.values

array([[1, 'bogdan_s', 18, '2032-01-01', 150, 500],
       [2, 'jane_smith', 35, '2032-02-15', 230, 720],
       [3, 'alex123', 25, '2032-04-25', 80, 200],
       [4, 'bob56', 38, '2032-06-21', 420, 940],
       [5, 'mark_wilson', 45, '2032-09-15', 310, 500]], dtype=object)

In [11]:
df.values[1,1]

'jane_smith'

In [12]:
df.head(3)

   User ID    Username  Age Joined Date  Total Posts  Reputation
0        1    bogdan_s   18  2032-01-01          150         500
1        2  jane_smith   35  2032-02-15          230         720
2        3     alex123   25  2032-04-25           80         200

In [13]:
df.tail(2)

   User ID     Username  Age Joined Date  Total Posts  Reputation
3        4        bob56   38  2032-06-21          420         940
4        5  mark_wilson   45  2032-09-15          310         500

In [14]:
df.describe().round(2)

       User ID    Age  Total Posts  Reputation
count     5.00   5.00          5.0        5.00
mean      3.00  32.20        238.0      572.00
std       1.58  10.71        133.3      276.62
min       1.00  18.00         80.0      200.00
25%       2.00  25.00        150.0      500.00
50%       3.00  35.00        230.0      500.00
75%       4.00  38.00        310.0      720.00
max       5.00  45.00        420.0      940.00

In [15]:
df.select_dtypes(include='object')

      Username Joined Date
0     bogdan_s  2032-01-01
1   jane_smith  2032-02-15
2      alex123  2032-04-25
3        bob56  2032-06-21
4  mark_wilson  2032-09-15

In [16]:
df.select_dtypes(include='object').columns

Index(['Username', 'Joined Date'], dtype='object')

In [17]:
df.select_dtypes(include='int64')

   User ID  Age  Total Posts  Reputation
0        1   18          150         500
1        2   35          230         720
2        3   25           80         200
3        4   38          420         940
4        5   45          310         500

In [18]:
df.isna()

   User ID  Username    Age  Joined Date  Total Posts  Reputation
0    False     False  False        False        False       False
1    False     False  False        False        False       False
2    False     False  False        False        False       False
3    False     False  False        False        False       False
4    False     False  False        False        False       False

# 2. Series

In [21]:
username_series = df['Username']
username_series

0       bogdan_s
1     jane_smith
2        alex123
3          bob56
4    mark_wilson
Name: Username, dtype: object

In [23]:
username_series.values

array(['bogdan_s', 'jane_smith', 'alex123', 'bob56', 'mark_wilson'],
      dtype=object)

In [25]:
df['Username'].value_counts()

Username
bogdan_s       1
jane_smith     1
alex123        1
bob56          1
mark_wilson    1
Name: count, dtype: int64